// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

// 456 -> 5
// 782 -> 8
// 918 -> 1
// int Test(int number){

//  Console.WriteLine( " вы ввели это число := "+number);
//  int hund = number/100;
//  int ten = number/10%10;
//     return ( ten);
// }
// Console.WriteLine("введите трехзначное число ");
// int number = Convert.ToInt32(Console.ReadLine());
//  int res = Test(number);

//  Console.WriteLine( "второе число :="+ res);